In [0]:
import pandas as pd

- dataframe : table
- series : column

In [4]:
#numpy와 비교
import numpy as np
data = np.array([1, 2, 3, 4, 5])
data

array([1, 2, 3, 4, 5])

In [5]:
data = pd.Series([1, 2, 3, 4, 5])
data


## 스칼라
## 벡터: 여러 스칼라
## Series: 하나의 벡터!

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data_2 = np.array([[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]])
data_2

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [7]:
data_2 = pd.Series([[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]])
data_2

0     [1, 2, 3, 4, 5]
1    [6, 7, 8, 9, 10]
dtype: object

In [8]:
data_2 = pd.DataFrame([[1, 2, 3, 4, 5], [6, 7, 8, 9, 10]],
                      columns=['a', 'b', 'c', 'd', 'e'],
                     index=['one', 'two'])
data_2

     a  b  c  d   e
one  1  2  3  4   5
two  6  7  8  9  10

In [9]:
data_2['a']

one    1
two    6
Name: a, dtype: int64

In [10]:
data_2.loc['one'] # = iloc = ix

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [11]:
data_2.iloc[0] # iloc 은 순서로 접근한다!

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [14]:
data_2.ix['one']

AttributeError: ignored

In [15]:
data = np.array([i for i in range(100)]).reshape(10,10)
# data = np.array([i for i in range(100)])
# data = data.reshape(10, 10)

data_3 = pd.DataFrame(data)
data_3

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [16]:
data_3.iloc[0]

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: 0, dtype: int64

In [17]:
data_3.iloc[1]

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
Name: 1, dtype: int64

In [19]:
data_3.loc[0]   # 이게 왜 되지?  Index가 default 값일 경우, 순서 == 이름

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: 0, dtype: int64

In [21]:
data_3.loc[1]

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
Name: 1, dtype: int64

In [22]:
data_3.ix[0]

AttributeError: ignored

In [23]:
data_3.iloc[1:5]   # 순서기 때문에 1부터 -1까지

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [24]:
data_3.loc[1:5]

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

In [25]:
data_3.ix[1:5]

AttributeError: ignored

Quiz) 위의 data_3에서 데이터 '54'를 지정해보세요.

In [26]:
data_3[4].loc[5]

54

In [27]:
data_3.loc[5][4]

54

In [28]:
data_3[5][4] #data_3[5]는 column의 indexing으로 간주

45

Quiz) 위의 data_3에서 데이터 '30~49'까지를 지정해보세요.

In [29]:
data_3.loc[3:5]

    0   1   2   3   4   5   6   7   8   9
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

In [30]:
data_3[[3, 4, 5]].head(2) #data_3[3:5]는 low의 slicing으로 간주

    3   4   5
0   3   4   5
1  13  14  15

In [35]:
#data_3에서 마지막 열만 빼고 나머지 전부 열 지정해보세요.
cols = list(data_3)
data_3[cols[:-1]].head()

    0   1   2   3   4   5   6   7   8
0   0   1   2   3   4   5   6   7   8
1  10  11  12  13  14  15  16  17  18
2  20  21  22  23  24  25  26  27  28
3  30  31  32  33  34  35  36  37  38
4  40  41  42  43  44  45  46  47  48

In [36]:
cols = list(data_3)
cols

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [37]:
# 마지막열을 맨 앞으로 옮기고 싶다면?
cols = list(data_3)
cols.insert(0, cols.pop())
cols

[9, 0, 1, 2, 3, 4, 5, 6, 7, 8]

In [38]:
data_3[cols]

    9   0   1   2   3   4   5   6   7   8
0   9   0   1   2   3   4   5   6   7   8
1  19  10  11  12  13  14  15  16  17  18
2  29  20  21  22  23  24  25  26  27  28
3  39  30  31  32  33  34  35  36  37  38
4  49  40  41  42  43  44  45  46  47  48
5  59  50  51  52  53  54  55  56  57  58
6  69  60  61  62  63  64  65  66  67  68
7  79  70  71  72  73  74  75  76  77  78
8  89  80  81  82  83  84  85  86  87  88
9  99  90  91  92  93  94  95  96  97  98

Quiz) 위의 data_3에서 데이터 '33, 43'까지를 지정해보세요.

In [39]:
data_3[3:5][:]

    0   1   2   3   4   5   6   7   8   9
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [40]:
data_3[3].iloc[3:5]

3    33
4    43
Name: 3, dtype: int64

In [41]:
data_3[3].loc[3:4]

3    33
4    43
Name: 3, dtype: int64

In [42]:
data_3.head(1)

   0  1  2  3  4  5  6  7  8  9
0  0  1  2  3  4  5  6  7  8  9

In [43]:
data_3.tail(3) #() 안적으면 5로 간주

    0   1   2   3   4   5   6   7   8   9
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [44]:
data_3.shape

(10, 10)

In [45]:
data_3.columns.dtype

dtype('int64')

In [46]:
data_3.index

RangeIndex(start=0, stop=10, step=1)

In [47]:
list(data_3) # =column값을 추출

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

- column의 순서를 바꾸고 싶다면?  
풀이) list 관점에서 생각하면 된다.

In [48]:
cols = list(data_3)

cols.insert(0, cols.pop(9))
cols

[9, 0, 1, 2, 3, 4, 5, 6, 7, 8]

In [49]:
data_3[cols]

    9   0   1   2   3   4   5   6   7   8
0   9   0   1   2   3   4   5   6   7   8
1  19  10  11  12  13  14  15  16  17  18
2  29  20  21  22  23  24  25  26  27  28
3  39  30  31  32  33  34  35  36  37  38
4  49  40  41  42  43  44  45  46  47  48
5  59  50  51  52  53  54  55  56  57  58
6  69  60  61  62  63  64  65  66  67  68
7  79  70  71  72  73  74  75  76  77  78
8  89  80  81  82  83  84  85  86  87  88
9  99  90  91  92  93  94  95  96  97  98

In [50]:
cols

[9, 0, 1, 2, 3, 4, 5, 6, 7, 8]

In [51]:
data_3[cols]

    9   0   1   2   3   4   5   6   7   8
0   9   0   1   2   3   4   5   6   7   8
1  19  10  11  12  13  14  15  16  17  18
2  29  20  21  22  23  24  25  26  27  28
3  39  30  31  32  33  34  35  36  37  38
4  49  40  41  42  43  44  45  46  47  48
5  59  50  51  52  53  54  55  56  57  58
6  69  60  61  62  63  64  65  66  67  68
7  79  70  71  72  73  74  75  76  77  78
8  89  80  81  82  83  84  85  86  87  88
9  99  90  91  92  93  94  95  96  97  98

In [52]:
data_3[0] = data_3[9]
data_3

    0   1   2   3   4   5   6   7   8   9
0   9   1   2   3   4   5   6   7   8   9
1  19  11  12  13  14  15  16  17  18  19
2  29  21  22  23  24  25  26  27  28  29
3  39  31  32  33  34  35  36  37  38  39
4  49  41  42  43  44  45  46  47  48  49
5  59  51  52  53  54  55  56  57  58  59
6  69  61  62  63  64  65  66  67  68  69
7  79  71  72  73  74  75  76  77  78  79
8  89  81  82  83  84  85  86  87  88  89
9  99  91  92  93  94  95  96  97  98  99

In [53]:
#dictionary 와 비교
dic = {'a': 1, 'b': 2}
dic

#데이터 수정 : 'a' <- 3
dic['a'] = 3
#데이터 추가 : 'c' <- 5
dic['c'] = 5

dic

{'a': 3, 'b': 2, 'c': 5}

- dataframe도 이와 같다.

In [54]:
df_1 = pd.DataFrame([[1, 2, 3], [4, 5, 6]], 
                    columns=['a', 'b', 'c'])
df_1

   a  b  c
0  1  2  3
1  4  5  6

In [55]:
df_1['d'] = pd.Series([7, 8])
df_1

   a  b  c  d
0  1  2  3  7
1  4  5  6  8

In [56]:
#데이터 수정 : 'a' <- 
df_1['a'] = df_1['b']

#데이터 추가 : 'd'
df_1['d'] = df_1['c']
df_1

   a  b  c  d
0  2  2  3  3
1  5  5  6  6

In [57]:
# df_1['a'] = df_1['a'] + 3
df_1['a'] += 3
df_1

   a  b  c  d
0  5  2  3  3
1  8  5  6  6

In [59]:
df_1['a'] = df_1['b']*df_1['c']
df_1

    a  b  c  d
0   6  2  3  3
1  30  5  6  6

In [60]:
df_1['b']

0    2
1    5
Name: b, dtype: int64

In [61]:
df_1['c']

0    3
1    6
Name: c, dtype: int64

In [62]:
# columns 지정하는 또다른 방법
df_1.a = df_1.b * df_1.c
df_1

    a  b  c  d
0   6  2  3  3
1  30  5  6  6

#### dataframe 병합

In [63]:
ArbNight = [['알라딘', 26],
            ['자스민', 25]]

cols = ['name', 'age']

df_1 = pd.DataFrame(ArbNight, columns=cols)
df_1

  name  age
0  알라딘   26
1  자스민   25

In [64]:
df_2 = pd.DataFrame([['지니', 3000], ['자카', 50]],
                   columns=['name', 'age'])
df_2

  name   age
0   지니  3000
1   자카    50

In [69]:
#  t 시험 출제!

df = pd.concat([df_1, df_2], ignore_index=True)
df

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자카    50

In [70]:
#  t 시험 출제!

df = df_1.append(df_2, ignore_index=True)
df

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자카    50

In [71]:
df_1

  name  age
0  알라딘   26
1  자스민   25

In [72]:
df_3 = pd.DataFrame([['알라딘', '남자'],['자스민', '여자']],
                   columns=['name', 'sex'])
df_3

  name sex
0  알라딘  남자
1  자스민  여자

In [73]:
df = df_1.merge(df_3)
df

  name  age sex
0  알라딘   26  남자
1  자스민   25  여자

Quiz) df에 직업 정보를 추가해보세요.

In [74]:
df_4 = pd.DataFrame([['알라딘', '무직'],['자스민', '공주']],
                   columns=['name', 'job'])
df_4

  name job
0  알라딘  무직
1  자스민  공주

In [75]:
df = df.merge(df_4)
df

  name  age sex job
0  알라딘   26  남자  무직
1  자스민   25  여자  공주

In [76]:
df_genie = pd.DataFrame({'name':['지니'], 'age':[3000], 
                         'sex':['남자'], 'job':['요정']})
df_genie

  name   age sex job
0   지니  3000  남자  요정

In [77]:
df = df.append(df_genie, ignore_index=True)
df

  name   age sex job
0  알라딘    26  남자  무직
1  자스민    25  여자  공주
2   지니  3000  남자  요정

In [78]:
df_country = pd.DataFrame({'name':['알라딘', '자스민', '자카'], '국적':['아라비아', '아라비아', '아라비아']})
df_country

  name    국적
0  알라딘  아라비아
1  자스민  아라비아
2   자카  아라비아

In [79]:
data = df.merge(df_country, how='left') #how = left, right, inner, outer
data

  name   age sex job    국적
0  알라딘    26  남자  무직  아라비아
1  자스민    25  여자  공주  아라비아
2   지니  3000  남자  요정   NaN

- merge ( how )

In [80]:
df_left = pd.DataFrame({'key': ['A', 'B', 'C'], 'left':[1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [81]:
df_right = pd.DataFrame({'key': ['A', 'B', 'D'], 'right':[4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

- merge ( on ) # 기준열 설정

In [82]:
df = df_left.merge(df_right, how='right', on='key')
df

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

- left, right 모두에게 'data'라는 이름의 columns을 추가하되, left와 right에 다른 값을 넣어보세요.

In [83]:
df_l = pd.DataFrame({'data': ['1000', '2000', '3000']})
df_left['data'] = df_l
df_left

  key  left  data
0   A     1  1000
1   B     2  2000
2   C     3  3000

In [84]:
df_r = pd.DataFrame({'data': ['a', 'b', 'c']})
df_right = df_right.join(df_r)
df_right

  key  right data
0   A      4    a
1   B      5    b
2   D      6    c

In [85]:
df = df_left.merge(df_right, on='key')
df

  key  left data_x  right data_y
0   A     1   1000      4      a
1   B     2   2000      5      b

- 반대로, 기준열로 삼아야하는 컬럼이 서로 이름이 다른경우

In [0]:
df_left = pd.DataFrame({'key': ['A', 'B', 'C'], 'left':[1, 2, 3]})
df_right = pd.DataFrame({'name': ['A', 'B', 'D'], 'right':[4, 5, 6]})

In [87]:
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [88]:
df_right

  name  right
0    A      4
1    B      5
2    D      6

In [89]:
df = df_left.merge(df_right, how='outer', left_on='key', right_on='name')
df

   key  left name  right
0    A   1.0    A    4.0
1    B   2.0    B    5.0
2    C   3.0  NaN    NaN
3  NaN   NaN    D    6.0

In [90]:
df = pd.concat([df_left, df_right]) #아래로 쌓인다.
df

   key  left name  right
0    A   1.0  NaN    NaN
1    B   2.0  NaN    NaN
2    C   3.0  NaN    NaN
0  NaN   NaN    A    4.0
1  NaN   NaN    B    5.0
2  NaN   NaN    D    6.0

In [91]:
df = pd.concat([df_left, df_right], axis=1) #옆으로 쌓인다.
df

  key  left name  right
0   A     1    A      4
1   B     2    B      5
2   C     3    D      6

In [92]:
data = pd.DataFrame({'name':['알라딘', '자스민', '지니'], 'age': [26, 25, 3000]})
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

- data라는 dataframe에 'name'이 '자파'인 데이터가 있는지 궁금하다면?

In [93]:
data['name']=='자파'

0    False
1    False
2    False
Name: name, dtype: bool

In [94]:
data[data['age']<=30]

  name  age
0  알라딘   26
1  자스민   25

In [95]:
data['name']=='지니'

0    False
1    False
2     True
Name: name, dtype: bool

In [96]:
data[data['name']=='지니']

  name   age
2   지니  3000

- data에서 알라딘과 자스민만 뽑아보세요.

In [97]:
data['name'].isin(['알라딘', '자스민'])

0     True
1     True
2    False
Name: name, dtype: bool

In [98]:
data[data['name'].isin(['알라딘', '자스민'])]

  name  age
0  알라딘   26
1  자스민   25

- age 기준으로 정렬을 하고 싶다면?

In [99]:
data.sort_values(['age'], ascending=False) #low로 정렬 sort_index

  name   age
2   지니  3000
0  알라딘    26
1  자스민    25

- csv 로 저장하고 싶다면?

In [100]:
data = pd.DataFrame({'name':['알라딘', '자스민', '지니'], 'age': [26, 25, 3000]})
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

In [0]:
data.to_csv('aladin.csv', index=False) #보통 index=False

In [102]:
data = pd.read_csv('aladin.csv')
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

In [0]:
data.to_excel('aladin.xls', index=False)

In [104]:
data = pd.read_excel('aladin.xls')
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

- name 컬럼을 인덱스로 사용하고 싶다면?

In [105]:
data = data.set_index('name')
data

       age
name
알라딘     26
자스민     25
지니    3000

In [0]:
data.to_csv("aladin.csv")

In [107]:
#저장된 csv파일을 읽어들일 때
data = pd.read_csv('aladin.csv')
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

In [108]:
data = pd.read_csv('aladin.csv', index_col='age')
data

     name
age
26    알라딘
25    자스민
3000   지니

In [0]:
from sklearn.datasets import load_breast_cancer

In [110]:
breast_cancer = load_breast_cancer()
breast_cancer

{'DESCR': '.. _breast_cancer_dataset:\n\nBreast cancer wisconsin (diagnostic) dataset\n--------------------------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 569\n\n    :Number of Attributes: 30 numeric, predictive attributes and the class\n\n    :Attribute Information:\n        - radius (mean of distances from center to points on the perimeter)\n        - texture (standard deviation of gray-scale values)\n        - perimeter\n        - area\n        - smoothness (local variation in radius lengths)\n        - compactness (perimeter^2 / area - 1.0)\n        - concavity (severity of concave portions of the contour)\n        - concave points (number of concave portions of the contour)\n        - symmetry \n        - fractal dimension ("coastline approximation" - 1)\n\n        The mean, standard error, and "worst" or largest (mean of the three\n        largest values) of these features were computed for each image,\n        resulting in 30 features.  For instance, field 3 is Mean Radius, field\n        13 is Radius SE, field 23 is Worst Radius.\n\n        - class:\n                - WDBC-Malignant\n                - WDBC-Benign\n\n    :Summary Statistics:\n\n    ===================================== ====== ======\n                                           Min    Max\n    ===================================== ====== ======\n    radius (mean):                        6.981  28.11\n    texture (mean):                       9.71   39.28\n    perimeter (mean):                     43.79  188.5\n    area (mean):                          143.5  2501.0\n    smoothness (mean):                    0.053  0.163\n    compactness (mean):                   0.019  0.345\n    concavity (mean):                     0.0    0.427\n    concave points (mean):                0.0    0.201\n    symmetry (mean):                      0.106  0.304\n    fractal dimension (mean):             0.05   0.097\n    radius (standard error):              0.112  2.873\n    texture (standard error):             0.36   4.885\n    perimeter (standard error):           0.757  21.98\n    area (standard error):                6.802  542.2\n    smoothness (standard error):          0.002  0.031\n    compactness (standard error):         0.002  0.135\n    concavity (standard error):           0.0    0.396\n    concave points (standard error):      0.0    0.053\n    symmetry (standard error):            0.008  0.079\n    fractal dimension (standard error):   0.001  0.03\n    radius (worst):                       7.93   36.04\n    texture (worst):                      12.02  49.54\n    perimeter (worst):                    50.41  251.2\n    area (worst):                         185.2  4254.0\n    smoothness (worst):                   0.071  0.223\n    compactness (worst):                  0.027  1.058\n    concavity (worst):                    0.0    1.252\n    concave points (worst):               0.0    0.291\n    symmetry (worst):                     0.156  0.664\n    fractal dimension (worst):            0.055  0.208\n    ===================================== ====== ======\n\n    :Missing Attribute Values: None\n\n    :Class Distribution: 212 - Malignant, 357 - Benign\n\n    :Creator:  Dr. William H. Wolberg, W. Nick Street, Olvi L. Mangasarian\n\n    :Donor: Nick Street\n\n    :Date: November, 1995\n\nThis is a copy of UCI ML Breast Cancer Wisconsin (Diagnostic) datasets.\nhttps://goo.gl/U2Uwz2\n\nFeatures are computed from a digitized image of a fine needle\naspirate (FNA) of a breast mass.  They describe\ncharacteristics of the cell nuclei present in the image.\n\nSeparating plane described above was obtained using\nMultisurface Method-Tree (MSM-T) [K. P. Bennett, "Decision Tree\nConstruction Via Linear Programming." Proceedings of the 4th\nMidwest Artificial Intelligence and Cognitive Science Society,\npp. 97-101, 1992], a classification method which uses linear\nprogramming to construct a decision tree.  Relevant features\nwere selected using an exhaustive search in the space of 1-4\nfeatures and 1-3 separating planes.\n\nThe actual linear program used to obtain the separating plane\nin the 3-dimensional space is that described in:\n[K. P. Bennett and O. L. Mangasarian: "Robust Linear\nProgramming Discrimination of Two Linearly Inseparable Sets",\nOptimization Methods and Software 1, 1992, 23-34].\n\nThis database is also available through the UW CS ftp server:\n\nftp ftp.cs.wisc.edu\ncd math-prog/cpo-dataset/machine-learn/WDBC/\n\n.. topic:: References\n\n   - W.N. Street, W.H. Wolberg and O.L. Mangasarian. Nuclear feature extraction \n     for breast tumor diagnosis. IS&T/SPIE 1993 International Symposium on \n     Electronic Imaging: Science and Technology, volume 1905, pages 861-870,\n     San Jose, CA, 1993.\n   - O.L. Mangasarian, W.N. Street and W.H. Wolberg. Breast cancer diagnosis and \n     prognosis via linear programming. Operations Research, 43(4), pages 570-577, \n     July-August 1995.\n   - W.H. Wolberg, W.N. Street, and O.L. Mangasarian. Machine learning techniques\n     to diagnose breast cancer from fine-needle aspirates. Cancer Letters 77 (1994) \n     163-171.',
 'data': array([[1.799e+01, 1.038e+01, 1.228e+02, ..., 2.654e-01, 4.601e-01,
         1.189e-01],
        [2.057e+01, 1.777e+01, 1.329e+02, ..., 1.860e-01, 2.750e-01,
         8.902e-02],
        [1.969e+01, 2.125e+01, 1.300e+02, ..., 2.430e-01, 3.613e-01,
         8.758e-02],
        ...,
        [1.660e+01, 2.808e+01, 1.083e+02, ..., 1.418e-01, 2.218e-01,
         7.820e-02],
        [2.060e+01, 2.933e+01, 1.401e+02, ..., 2.650e-01, 4.087e-01,
         1.240e-01],
        [7.760e+00, 2.454e+01, 4.792e+01, ..., 0.000e+00, 2.871e-01,
         7.039e-02]]),
 'feature_names': array(['mean radius', 'mean texture', 'mean perimeter', 'mean area',
        'mean smoothness', 'mean compactness', 'mean concavity',
        'mean concave points', 'mean symmetry', 'mean fractal dimension',
        'radius error', 'texture error', 'perimeter error', 'area error',
        'smoothness error', 'compactness error', 'concavity error',
        'concave points error', 'symmetry error',
        'fractal dimension error', 'worst radius', 'worst texture',
        'worst perimeter', 'worst area', 'worst smoothness',
        'worst compactness', 'worst concavity', 'worst concave points',
        'worst symmetry', 'worst fractal dimension'], dtype='<U23'),
 'filename': '/usr/local/lib/python3.6/dist-packages/sklearn/datasets/data/breast_cancer.csv',
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0,
        1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0,
        1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1,
        1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0,
        0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1,
        1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
        0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0,
        1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1,
        1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0,
        0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0,
        1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1,
        1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1,
        1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0,
        1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1,
        1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1,
        1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1]),
 'target_names': array(['malignant', 'benign'], dtype='<U9')}

In [111]:
print(breast_cancer['DESCR'])

.. _breast_cancer_dataset:

Breast cancer wisconsin (diagnostic) dataset
--------------------------------------------

**Data Set Characteristics:**

    :Number of Instances: 569

    :Number of Attributes: 30 numeric, predictive attributes and the class

    :Attribute Information:
        - radius (mean of distances from center to points on the perimeter)
        - texture (standard deviation of gray-scale values)
        - perimeter
        - area
        - smoothness (local variation in radius lengths)
        - compactness (perimeter^2 / area - 1.0)
        - concavity (severity of concave portions of the contour)
        - concave points (number of concave portions of the contour)
        - symmetry
        - fractal dimension ("coastline approximation" - 1)

        The mean, standard error, and "worst" or largest (mean of the three
        largest values) of these features were computed for each image,
        resulting in 30 features.  For instance, field 3 is Mean Radius, field
        13 is Radius SE, field 23 is Worst Radius.

        - class:
                - WDBC-Malignant
                - WDBC-Benign

    :Summary Statistics:

    ===================================== ====== ======
                                           Min    Max
    ===================================== ====== ======
    radius (mean):                        6.981  28.11
    texture (mean):                       9.71   39.28
    perimeter (mean):                     43.79  188.5
    area (mean):                          143.5  2501.0
    smoothness (mean):                    0.053  0.163
    compactness (mean):                   0.019  0.345
    concavity (mean):                     0.0    0.427
    concave points (mean):                0.0    0.201
    symmetry (mean):                      0.106  0.304
    fractal dimension (mean):             0.05   0.097
    radius (standard error):              0.112  2.873
    texture (standard error):             0.36   4.885
    perimeter (standard error):           0.757  21.98
    area (standard error):                6.802  542.2
    smoothness (standard error):          0.002  0.031
    compactness (standard error):         0.002  0.135
    concavity (standard error):           0.0    0.396
    concave points (standard error):      0.0    0.053
    symmetry (standard error):            0.008  0.079
    fractal dimension (standard error):   0.001  0.03
    radius (worst):                       7.93   36.04
    texture (worst):                      12.02  49.54
    perimeter (worst):                    50.41  251.2
    area (worst):                         185.2  4254.0
    smoothness (worst):                   0.071  0.223
    compactness (worst):                  0.027  1.058
    concavity (worst):                    0.0    1.252
    concave points (worst):               0.0    0.291
    symmetry (worst):                     0.156  0.664
    fractal dimension (worst):            0.055  0.208
    ===================================== ====== ======

    :Missing Attribute Values: None

    :Class Distribution: 212 - Malignant, 357 - Benign

    :Creator:  Dr. William H. Wolberg, W. Nick Street, Olvi L. Mangasarian

    :Donor: Nick Street

    :Date: November, 1995

This is a copy of UCI ML Breast Cancer Wisconsin (Diagnostic) datasets.
https://goo.gl/U2Uwz2

Features are computed from a digitized image of a fine needle
aspirate (FNA) of a breast mass.  They describe
characteristics of the cell nuclei present in the image.

Separating plane described above was obtained using
Multisurface Method-Tree (MSM-T) [K. P. Bennett, "Decision Tree
Construction Via Linear Programming." Proceedings of the 4th
Midwest Artificial Intelligence and Cognitive Science Society,
pp. 97-101, 1992], a classification method which uses linear
programming to construct a decision tree.  Relevant features
were selected using an exhaustive search in the space of 1-4
features and 1-3 separating planes.

The actual linear program used to obtain the separating plane
in the 3-dimensional space is that described in:
[K. P. Bennett and O. L. Mangasarian: "Robust Linear
Programming Discrimination of Two Linearly Inseparable Sets",
Optimization Methods and Software 1, 1992, 23-34].

This database is also available through the UW CS ftp server:

ftp ftp.cs.wisc.edu
cd math-prog/cpo-dataset/machine-learn/WDBC/

.. topic:: References

   - W.N. Street, W.H. Wolberg and O.L. Mangasarian. Nuclear feature extraction
     for breast tumor diagnosis. IS&T/SPIE 1993 International Symposium on
     Electronic Imaging: Science and Technology, volume 1905, pages 861-870,
     San Jose, CA, 1993.
   - O.L. Mangasarian, W.N. Street and W.H. Wolberg. Breast cancer diagnosis and
     prognosis via linear programming. Operations Research, 43(4), pages 570-577,
     July-August 1995.
   - W.H. Wolberg, W.N. Street, and O.L. Mangasarian. Machine learning techniques
     to diagnose breast cancer from fine-needle aspirates. Cancer Letters 77 (1994)
     163-171.

In [113]:
# 1. data 추출
x_data = breast_cancer['data']
y_data = breast_cancer['target']
feature_names = breast_cancer['feature_names']
target_names = breast_cancer['target_names']

print(x_data.shape, y_data.shape)
print(feature_names.shape, target_names.shape)

(569, 30) (569,)
(30,) (2,)

In [116]:
import pandas as pd
# 2. 추출한 data를 가지고 dataframe을 만든다.
feature_df = pd.DataFrame(x_data, columns=feature_names)
feature_df.head()

   mean radius  mean texture  ...  worst symmetry  worst fractal dimension
0        17.99         10.38  ...          0.4601                  0.11890
1        20.57         17.77  ...          0.2750                  0.08902
2        19.69         21.25  ...          0.3613                  0.08758
3        11.42         20.38  ...          0.6638                  0.17300
4        20.29         14.34  ...          0.2364                  0.07678

[5 rows x 30 columns]

In [117]:
target_names[0]

'malignant'

In [118]:
print(target_names[0], end=' -> ')
print(target_names[0][0], end=' -> ')
print(target_names[0][0].upper())

malignant = target_names[0][0].upper()
benign = target_names[1][0].upper()
#upper() to 대문자 lower() to 소문자

malignant -> m -> M

In [120]:
# target_name = target_names[0] + '/' + target_names[1]
target_name = '{}/{}'.format(malignant, benign)
target_df = pd.DataFrame(y_data, columns=[target_name])
target_df.head()

   M/B
0    0
1    0
2    0
3    0
4    0

In [121]:
data_df = pd.concat([feature_df, target_df], axis=1)
data_df.head()

   mean radius  mean texture  ...  worst fractal dimension  M/B
0        17.99         10.38  ...                  0.11890    0
1        20.57         17.77  ...                  0.08902    0
2        19.69         21.25  ...                  0.08758    0
3        11.42         20.38  ...                  0.17300    0
4        20.29         14.34  ...                  0.07678    0

[5 rows x 31 columns]

In [122]:
data_df.shape

(569, 31)

In [123]:
data_df.describe() #기초 통계수치

       mean radius  mean texture  ...  worst fractal dimension         M/B
count   569.000000    569.000000  ...               569.000000  569.000000
mean     14.127292     19.289649  ...                 0.083946    0.627417
std       3.524049      4.301036  ...                 0.018061    0.483918
min       6.981000      9.710000  ...                 0.055040    0.000000
25%      11.700000     16.170000  ...                 0.071460    0.000000
50%      13.370000     18.840000  ...                 0.080040    1.000000
75%      15.780000     21.800000  ...                 0.092080    1.000000
max      28.110000     39.280000  ...                 0.207500    1.000000

[8 rows x 31 columns]

In [124]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 569 entries, 0 to 568
Data columns (total 31 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   mean radius              569 non-null    float64
 1   mean texture             569 non-null    float64
 2   mean perimeter           569 non-null    float64
 3   mean area                569 non-null    float64
 4   mean smoothness          569 non-null    float64
 5   mean compactness         569 non-null    float64
 6   mean concavity           569 non-null    float64
 7   mean concave points      569 non-null    float64
 8   mean symmetry            569 non-null    float64
 9   mean fractal dimension   569 non-null    float64
 10  radius error             569 non-null    float64
 11  texture error            569 non-null    float64
 12  perimeter error          569 non-null    float64
 13  area error               569 non-null    float64
 14  smoothness error         569 non-null    float64
 15  compactness error        569 non-null    float64
 16  concavity error          569 non-null    float64
 17  concave points error     569 non-null    float64
 18  symmetry error           569 non-null    float64
 19  fractal dimension error  569 non-null    float64
 20  worst radius             569 non-null    float64
 21  worst texture            569 non-null    float64
 22  worst perimeter          569 non-null    float64
 23  worst area               569 non-null    float64
 24  worst smoothness         569 non-null    float64
 25  worst compactness        569 non-null    float64
 26  worst concavity          569 non-null    float64
 27  worst concave points     569 non-null    float64
 28  worst symmetry           569 non-null    float64
 29  worst fractal dimension  569 non-null    float64
 30  M/B                      569 non-null    int64
dtypes: float64(30), int64(1)
memory usage: 137.9 KB

In [125]:
data_df.isnull().sum()

mean radius                0
mean texture               0
mean perimeter             0
mean area                  0
mean smoothness            0
mean compactness           0
mean concavity             0
mean concave points        0
mean symmetry              0
mean fractal dimension     0
radius error               0
texture error              0
perimeter error            0
area error                 0
smoothness error           0
compactness error          0
concavity error            0
concave points error       0
symmetry error             0
fractal dimension error    0
worst radius               0
worst texture              0
worst perimeter            0
worst area                 0
worst smoothness           0
worst compactness          0
worst concavity            0
worst concave points       0
worst symmetry             0
worst fractal dimension    0
M/B                        0
dtype: int64

In [126]:
data_df.dtypes

mean radius                float64
mean texture               float64
mean perimeter             float64
mean area                  float64
mean smoothness            float64
mean compactness           float64
mean concavity             float64
mean concave points        float64
mean symmetry              float64
mean fractal dimension     float64
radius error               float64
texture error              float64
perimeter error            float64
area error                 float64
smoothness error           float64
compactness error          float64
concavity error            float64
concave points error       float64
symmetry error             float64
fractal dimension error    float64
worst radius               float64
worst texture              float64
worst perimeter            float64
worst area                 float64
worst smoothness           float64
worst compactness          float64
worst concavity            float64
worst concave points       float64
worst symmetry             float64
worst fractal dimension    float64
M/B                          int64
dtype: object

In [127]:
data_df.corr()

                         mean radius  ...       M/B
mean radius                 1.000000  ... -0.730029
mean texture                0.323782  ... -0.415185
mean perimeter              0.997855  ... -0.742636
mean area                   0.987357  ... -0.708984
mean smoothness             0.170581  ... -0.358560
mean compactness            0.506124  ... -0.596534
mean concavity              0.676764  ... -0.696360
mean concave points         0.822529  ... -0.776614
mean symmetry               0.147741  ... -0.330499
mean fractal dimension     -0.311631  ...  0.012838
radius error                0.679090  ... -0.567134
texture error              -0.097317  ...  0.008303
perimeter error             0.674172  ... -0.556141
area error                  0.735864  ... -0.548236
smoothness error           -0.222600  ...  0.067016
compactness error           0.206000  ... -0.292999
concavity error             0.194204  ... -0.253730
concave points error        0.376169  ... -0.408042
symmetry error             -0.104321  ...  0.006522
fractal dimension error    -0.042641  ... -0.077972
worst radius                0.969539  ... -0.776454
worst texture               0.297008  ... -0.456903
worst perimeter             0.965137  ... -0.782914
worst area                  0.941082  ... -0.733825
worst smoothness            0.119616  ... -0.421465
worst compactness           0.413463  ... -0.590998
worst concavity             0.526911  ... -0.659610
worst concave points        0.744214  ... -0.793566
worst symmetry              0.163953  ... -0.416294
worst fractal dimension     0.007066  ... -0.323872
M/B                        -0.730029  ...  1.000000

[31 rows x 31 columns]

In [0]:
pd.DataFrame.sort_values?

In [129]:
abs(data_df.corr()['M/B']).sort_values(ascending=False)

M/B                        1.000000
worst concave points       0.793566
worst perimeter            0.782914
mean concave points        0.776614
worst radius               0.776454
mean perimeter             0.742636
worst area                 0.733825
mean radius                0.730029
mean area                  0.708984
mean concavity             0.696360
worst concavity            0.659610
mean compactness           0.596534
worst compactness          0.590998
radius error               0.567134
perimeter error            0.556141
area error                 0.548236
worst texture              0.456903
worst smoothness           0.421465
worst symmetry             0.416294
mean texture               0.415185
concave points error       0.408042
mean smoothness            0.358560
mean symmetry              0.330499
worst fractal dimension    0.323872
compactness error          0.292999
concavity error            0.253730
fractal dimension error    0.077972
smoothness error           0.067016
mean fractal dimension     0.012838
texture error              0.008303
symmetry error             0.006522
Name: M/B, dtype: float64

In [0]:
idx_abs = abs(data_df.corr()['M/B']).sort_values(ascending=False).index

In [131]:
target_cor = data_df.corr()['M/B']
target_cor.loc[idx_abs]

M/B                        1.000000
worst concave points      -0.793566
worst perimeter           -0.782914
mean concave points       -0.776614
worst radius              -0.776454
mean perimeter            -0.742636
worst area                -0.733825
mean radius               -0.730029
mean area                 -0.708984
mean concavity            -0.696360
worst concavity           -0.659610
mean compactness          -0.596534
worst compactness         -0.590998
radius error              -0.567134
perimeter error           -0.556141
area error                -0.548236
worst texture             -0.456903
worst smoothness          -0.421465
worst symmetry            -0.416294
mean texture              -0.415185
concave points error      -0.408042
mean smoothness           -0.358560
mean symmetry             -0.330499
worst fractal dimension   -0.323872
compactness error         -0.292999
concavity error           -0.253730
fractal dimension error   -0.077972
smoothness error           0.067016
mean fractal dimension     0.012838
texture error              0.008303
symmetry error             0.006522
Name: M/B, dtype: float64

In [132]:
data_df.mean()

mean radius                 14.127292
mean texture                19.289649
mean perimeter              91.969033
mean area                  654.889104
mean smoothness              0.096360
mean compactness             0.104341
mean concavity               0.088799
mean concave points          0.048919
mean symmetry                0.181162
mean fractal dimension       0.062798
radius error                 0.405172
texture error                1.216853
perimeter error              2.866059
area error                  40.337079
smoothness error             0.007041
compactness error            0.025478
concavity error              0.031894
concave points error         0.011796
symmetry error               0.020542
fractal dimension error      0.003795
worst radius                16.269190
worst texture               25.677223
worst perimeter            107.261213
worst area                 880.583128
worst smoothness             0.132369
worst compactness            0.254265
worst concavity              0.272188
worst concave points         0.114606
worst symmetry               0.290076
worst fractal dimension      0.083946
M/B                          0.627417
dtype: float64

In [133]:
# concat [a, b]  # a 아래에 b를 붙이다

NameError: ignored

In [134]:
# a append b   # a 아래에 b를 붙이다

SyntaxError: ignored